#include <stdio.h>
#include <sys/socket.h>
#include <sys/types.h>
#include <arpa/inet.h>
#include <netinet/in.h>
#include <netinet/tcp.h>
#include <errno.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <signal.h>
#include <sys/select.h>
#include <limits.h>
#include <alsa/asoundlib.h>
#include <libgen.h>
#include <fcntl.h>
#include <sys/time.h>

#include <iostream>
#include <thread>

#include "mp3_enc_interface.h"
#include "pcm_mp3enc.h"
#include "pcm_wav_function.h"

#define MP3_OUTPUT 					false
#define DEBUG_MSG 					false

#define SLEEP_TIME                  1000
#define OUTPUT_PATH_MP3_SAMPLE      "/tmp/output.mp3"


#if MP3_OUTPUT 
FILE		*gOutputFd;
#endif

void SendClientList(void);

namespace Common {
	using namespace std;

	/* const variables */
	const bool 	TYPE_PROTOCOL_UDP	= false;
	const bool 	TYPE_PROTOCOL_TCP	= true;

	const int	SIZE_SCALE_SNDBUF	= 10;
	const int	SIZE_BACK_LOG		= 40;

	const int	DEFAULT_TRANS_CNT   = 2;
	const int	DEFAULT_THREAD_CNT  = 1;

	const int	TIMEOUT_ACCEPT_SEC	= 2;
	const int	TIMEOUT_ACCEPT_MSEC	= 0;
	const int	TIME_RCV_TIMEOUT	= 2;
	const int	TIME_SLEEP			= 1000; // us

	const int	FLAG_HB_REQUEST		= 0;
	const int	FLAG_HB_RESPONSE    = 1;
	const int	FLAG_ODD			= 1;
	const int	FLAG_EVEN			= 2;
	const int	MODE_PCM_STREAM		= 0;
	const int	MODE_MP3_STREAM		= 1;

	const int	SIZE_QUEUE_STACK	= 1024;
	const int	SIZE_QUEUE_SCALE	= 5;

	const int 	FLAG_READ_MODE 		= 0;
	const int 	FLAG_FILE_MODE 		= 1;

	const int 	SIZE_PCM_PERIODS	= 12;

	const int	COUNT_MAX_ACC_CLNT	= 40;

	const char *STR_MSG_HOSTNAME	= "hostName:";
	
	/* struct */
	struct SOCKET_INFO {
		int    			socketFd;		// socket descriptor for UDP
		int     		typeProtocol;	// TCP or UDP
		int 		    typeCast;		// SOCK_STREAM or SOCK_DGRAM
		int				port;
		char			ipAddr[24];
		int				clientCnt;
	} typedef SOCKET_INFO_t;

	struct	CLIENT_INFO {
		int				idx;
		int				socketFd;
		char			ipAddr[16];	
		char			hostName[128];
		char			connTime[128];
		char			macAddr[128];
	} typedef CLIENT_INFO_t;

	struct CLIENT_LIST {
		int             connCnt;
		char            ipAddr[24];
		char            beforeStat[128];
		char            currentStat[128];
		char            beforeTime[128];
		char            currentTime[128];
		char            workingTime[128];
		char            disconnTime[128];
		char            hostName[128];
		time_t          startTime;
		time_t          endTime;
		char            macAddr[24];
	} typedef CLIENT_LIST_t;

	struct HOST_INFO {
		char            hostName[128];
		char            macAddr[128];
	} typedef HOST_INFO_t;

	struct PLAY_INFO {
		int       		rate;
		int        		channels;
		int       		chunkSize;
		int       		idx;
		int				encodeMode;
		unsigned int    pcmBufferSize;
		unsigned int    pcmPeriodSize;
	} typedef PLAY_INFO_t;

	struct ENCODE_INFO {
		int   			chunkSize;
		short   		bitRate;
		int     		sampleRate;
	} typedef ENCODE_INFO_t;

	struct HEADER_PCM_INFO {
		unsigned int    seqNumber;      // 4
		int             rate;           // 8
		short           channels;       // 10
		short           chunkSize;      // 12
		unsigned short  crcValue;       // 14
		char            rsvd[10];       // 26
		unsigned int    pcmBufferSize;  // 30
		unsigned int    pcmPeriodSize;  // 34
		char            rsvd2[32];      // 64
	} typedef HEADER_PCM_INFO_t;

	struct HEADER_MP3_INFO {
		unsigned int    seqNumber;      // 4
		int             rate;           // 8
		short           channels;       // 10
		short           chunkSize;      // 12
		unsigned short  crcValue;       // 14
		short           encMode;        // 16 (0 : pcm, 1 : mp3)
		int             sampleRate;     // 20
		short           bitRate;        // 22
		short           pcmChunkSize;   // 24
		unsigned int    pcmBufferSize;  // 28
		unsigned int    pcmPeriodSize;  // 32
		char            rsvd2[32];      // 64
	} typedef HEADER_MP3_INFO_t;

	struct HEADER_MP3_CHUNK {
		short           chunkSize;      // 02
	} typedef HEADER_MP3_CHUNK_t;

	struct MP3_IDX_INFO {
		MP3E_INT8   *mp3Frame;
		int         index;
		int         socketFd;
	} typedef MP3_IDX_INFO_t;

	struct QUEUE_STACK {
		int     recvCnt;
		int     sendCnt;
		int     stackSize;
		char    **stack;
	} typedef QUEUE_STACK_t;

	struct PCM_CAPTURE {
		char    flagMode;
		FILE    *pcmFile;
	} typedef PCM_CAPTURE_t;

	struct SERVER_INFO {
		// Queue parameter
		int     queueCnt;
		int     bufferRate;
		int     chunkSize;

		// PCM parameter
		int     sampleRate;
		int     channels;

		// MP3 parameter
		bool    mp3_mode;
		int     mp3_chunkSize;
		int     mp3_bitRate;
		int     mp3_sampleRate;

		// server parameter
		bool    typeProtocol;
		char    castType[24];
		int     port;
		int     clientCnt;
		char    ipAddr[24];

		bool    typePlayMode;
		char    fileName[128];
		char	deviceName[128];
	} typedef SERVER_INFO_t;

	struct MP3_HEADER {
		int     version;
		int     layer;
		int     errp;
