#include <stdio.h>
#include <sys/socket.h>
#include <sys/types.h>
#include <arpa/inet.h>
#include <netinet/in.h>
#include <netinet/tcp.h>
#include <errno.h>
#include <string.h>
#include <stdlib.h>
#include <unistd.h>
#include <signal.h>
#include <sys/select.h>
#include <limits.h>
#include <alsa/asoundlib.h>

#include <iostream>
#include <thread>
#include <net/if.h>
#include <sys/ioctl.h>
#include <sys/time.h>
#include <netinet/ether.h>

#include "mp3_dec_interface.h"

namespace Common {
	using namespace std;

	/* const variables */

	const bool  TYPE_PROTOCOL_UDP   = false;
	const bool  TYPE_PROTOCOL_TCP   = true;

	const int TIME_SLEEP			= 1000; // us
	const int TIME_WAIT_REQUEST 	= 2;
	const int TIME_RCV_TIMEOUT 		= 2; // 2s, 
	const int TIME_WAIT_PLAYINFO 	= 3;
	const int TIME_TIMEOUT_SEC 		= 2;
	const int TIME_BUFFER_WAIT    	= 10 * 1000;

	const int FLAG_ODD				= 1;
	const int FLAG_EVEN				= 2;

	const int SIZE_QUEUE_STACK		= 1024;
	const int SIZE_QUEUE_SCALE		= 5;

	const int PERIODS_SIZE    		= 12;

	const int BYTE_PCM_FRAME 		= 1;
	const int BYTE_MP3_FRAME 		= 2;
	const int SIZE_SCALE_RCVBUF 	= 10;


	const int FLAG_TCP 				= 1;
	const int FLAG_UDP 				= 0;
	const int FLAG_MODE_MP3 		= 1;
	const int FLAG_MODE_PCM 		= 0;

	const int FLAG_HB_REQUEST 		= 0;
	const int FLAG_HB_RESPONSE 		= 1;
	const int COUNT_CRC_MAX     	= 20;
	const int COUNT_SEND_RETRY 		= 3; 

	const char *STR_SERVER_IP 		= "SERVER_IPADDR";
	const char *STR_CAST_MODE 		= "CAST_MODE";
	const char *STR_TCP_MODE 		= "UNI-CAST (TCP)";
	const char *STR_UDP_MODE 		= "MULTI-CAST (UDP)";
	const char *STR_MCAST_IPADDR 	= "MCAST_IPADDR";
	const char *STR_MCAST_PORT 		= "MCAST_PORT";
	const char *STR_SERVER_PORT 	= "UNI-CAST PORT";
	const char *STR_ENCODE_MODE		= "ENCODE MODE";
	const char *STR_RATE			= "RATE";
	const char *STR_CHANNELS    	= "CHANNELS";
	const char *STR_CHUNK_SIZE 		= "CHUNK_SIZE";
	const char *STR_BUFFER_RATE 	= "BUFFER_TIME(Sec)";
	const char *STR_BUFFER_RATE_MS 	= "BUFFER_TIME(Msec)";
	const char *STR_MP3_SAMPLE_RATE = "MP3 RATE";
	const char *STR_MP3_BIT_RATE	= "MP3 BIT_RATE";

	const char *JSONFILE 			= "/opt/interm/public_html/modules/network_setup/conf/network_stat.json";



	const char *STR_ENCODE_PCM 		= "PCM";
	const char *STR_ENCODE_MP3 		= "MP3";

	const char *PATH_SAMPLE_RATE 	= "/tmp/sampleRate";

	const int FLAG_ENCODE_MP3 		= 1;
	const int SIZE_DEFAULT_VOLUME 	= 100;

 	const int SIZE_KBYTE          	= 1024;
 	const int SIZE_MBYTE          	= 1024 * 1024;

	const int SIZE_MAX_SCALE_LAYER  = 144;

	const int DIV_SAMPLING_RATE     = 24000;
	const int MIN_SAMPLING_RATE     = 576;
	const int MAX_SAMPLING_RATE     = 1152;

	const int SIZE_MP3_FRAME_BUFFER = 2048 * 4;
	const int SIZE_MP3_THRESHOLD    = 2881 + 8;
	
	const int MP3_LAYER_3  			= 3;
	const int MP3_LAYER_2  			= 2;
	const int MP3_LAYER_1   		= 1;

	const int COUNT_PREPARE_RETRY   = 3;

	void GetTime(char *_output) {
		time_t nowTime = time(NULL);
		struct tm *tmNow = localtime(&nowTime);

		sprintf(_output, "%04d-%02d-%02d %02d:%02d:%02d",
				tmNow->tm_year + 1900, tmNow->tm_mon + 1, tmNow->tm_mday,
				tmNow->tm_hour, tmNow->tm_min, tmNow->tm_sec);

		return ;
	} // end of GetTime()

	void ChangeTime(int _sec, char *_output) {
		int day  = 0;
		int hour = _sec / 3600;
		int min  = (_sec / 60) % 60;
		int sec  = _sec % 60;

		if( hour >= 24 ) {
			day = hour / 24;
			hour %= 24;
		}

		sprintf(_output, "%02d days %02d:%02d:%02d", day, hour, min, sec);

		return ;
	} // end of ChangeTime()

	double time_diff(struct timeval x , struct timeval y)
	{
		double x_ms , y_ms , diff;

		x_ms = (double)x.tv_sec*1000000 + (double)x.tv_usec;
		y_ms = (double)y.tv_sec*1000000 + (double)y.tv_usec;

		diff = (double)y_ms - (double)x_ms;

		return diff;
	}

	class CommonFunc {
		private :
			bool    flagTerm = false;
			bool    reconFlag = false;
		public  :
			// CommonFunc(void);
			void    handler(void);
			void    term(void);
			bool 	getFlagTerm();
			bool 	getReconFlag();
			bool    setReconFlag();
			bool 	setFlagTerm();
	}; // end of class : CommonFunc
	CommonFunc  common;

	class SigHandler {
		public  :
			SigHandler(void) {
				signal(SIGINT,  this->term);
				signal(SIGSEGV, this->term);

				return ;
			}

			static void term(int _sigNum) {
				static bool flagTerm = false;

				if( _sigNum == SIGSEGV ) {
					if( flagTerm ) {
						fprintf(stderr, "force exit.. process died\n");
						exit(0);
					} 

					fprintf(stderr, "catch segmentation fault\n");
						exit(0);
				}

				if( flagTerm ) {
					fprintf(stderr, "already terminated\n");
				}

				flagTerm = true;

				common.handler();
			}
	}; // end of class : SigHandler
	SigHandler  handler;
	
	struct CAST_INFO {
		int 	type;       // TCP or UDP
		int 	cast;       // STREAM or DGRAM
		int 	sockFd;     // socket descriptor for UDP
	} typedef CAST_INFO_t;

	struct CLIENT_PARAMS {
		int  	serverCnt;
	} typedef CLIENT_PARAMS_t;

	struct CLIENT_INFO {
		int     delay;
		int     delayMs;
		int 	playVolume;

		// server parameter
		int 	typeProtocol;
		int     serverCnt;
		char    castType[24];
		char    ipAddr1[24];
		char    ipAddr2[24];
		int     port1;
		int     port2;
		char    mIpAddr[24];
		int     mPort;

		int 	chunkSize;
		int 	sampleRate;
		int 	channels;
		int 	mp3_mode;
		int 	mp3_chunkSize;
		int 	mp3_bitRate;
		int 	mp3_sampleRate;
		int 	ipStatus;

		char    hostName[128];
		char    deviceName[128];
	} typedef CLIENT_INFO_t;

	struct DELAY_INFO {
		int		mbScale;
		int     bufRate;
		int     bufRateMs;
		int		playVolume; 
	} typedef DELAY_INFO_t;

	struct ENCODE_INFO {
		int		chunkSize;
		short   bitRate;
		int     sampleRate;
	} typedef ENCODE_INFO_t;

	struct HOST_INFO {
		char 	hostName[128];
		char	macAddr[128];
	} typedef HOST_INFO_t;

	struct HEADER_PCM_INFO {
		unsigned int    seqNumber;      // 4
		int             rate;           // 8
		short           channels;       // 10
		short           chunkSize;      // 12
		unsigned short  crcValue;       // 14
		char            rsvd[10];       // 26
		unsigned int    pcmBufferSize;  // 30
		unsigned int    pcmPeriodSize;  // 34
		char            rsvd2[32];      // 64
	} typedef HEADER_PCM_INFO_t;

	struct HEADER_MP3_INFO {
		unsigned int    seqNumber;      // 4
		int             rate;           // 8
		short           channels;       // 10
		short           chunkSize;      // 12
		unsigned short  crcValue;       // 14
		short           encMode;        // 16 (0 : pcm, 1 : mp3)
		int             sampleRate;     // 20
		short           bitRate;        // 22
		short           pcmChunkSize;   // 24
		unsigned int    pcmBufferSize;  // 28
		unsigned int    pcmPeriodSize;  // 32
		char            rsvd[32];       // 64
	} typedef HEADER_MP3_INFO_t;
	
	struct HEADER_MP3_CHUNK {
		short           chunkSize;      // 02
	} typedef HEADER_MP3_CHUNK_t;

	struct IP_INFO {
		int  	port1;
		int  	port2;
		int  	mPort;
		int	 	serverCnt;
		int  	typeProtocol;
		char 	castType[24];
		char 	ipAddr1[24];
		char 	ipAddr2[24];
		char 	mIpAddr[24];
	
	} typedef IP_INFO_t;

	struct PLAY_INFO {
		int             rate;
		int             channels;
		int             chunkSize;
		int             idx;
		int             encodeMode;
		unsigned int    pcmBufferSize;
		unsigned int    pcmPeriodSize;
	} typedef PLAY_INFO_t;

	struct QUEUE_STACK {
		int     recvCnt;
		int     sendCnt;
		int     stackSize;
		char    **stack;
	} typedef QUEUE_STACK_t;

	struct SERVER_LIST {
		int  	port;
		char 	ipAddr[128];
		char 	stat;
	} typedef SERVER_LIST_t;

	struct VAR_FLAG {
		char	threadRecv;
		char    extOrder;
		char    term;
		char    alsaFrame;
		char   	closeHandle;
		char   	connFlag;
		char    encMode;
		char    playLoop;
	} typedef VAR_FLAG_t;

	struct QUEUE_INFO {
